starjunes/GD32/source/hal/driver/c/hal_can_drv.c
    if (used >= loop->max) {
        return FALSE;
    }
    
    pos += used;
    if (pos >= loop->max) {
        pos -= loop->max;
    }
        
    YX_MEMCPY((INT8U *)&loop->pmsg[pos], sizeof(CAN_DATA_T), (INT8U *)data, sizeof(CAN_DATA_T));
    
    loop->used++;
    return TRUE;
}

/*******************************************************************
** 函数名称: STM32_CAN_PinsConfig
** 函数描述: 管脚配置
** 参数:     [in] pinfo: 配置表
**           [in] onoff: 打开/关闭, TRUE-打开串口,FALSE-关闭串口
** 返回:     无
********************************************************************/
static void STM32_CAN_PinsConfig(const CAN_REG_T *pinfo, INT8U onoff)
{
    GPIO_InitTypeDef gpio_initstruct;
    
    if (pinfo == 0) {
        return;
    }
    
    RCC_AHBPeriphClockCmd(RCC_APB2Periph_AFIO | RCC_APB2Periph_GPIOB, ENABLE);                        /* 开启GPIO系统时钟 */

    
    /* Configure USARTx_Tx as alternate function push-pull */
    gpio_initstruct.GPIO_Pin   = (INT16U)(1 << pinfo->pin_tx);
    gpio_initstruct.GPIO_Speed = GPIO_Speed_50MHz;
    //gpio_initstruct.GPIO_OType = GPIO_OType_PP;
    //gpio_initstruct.GPIO_PuPd  = GPIO_PuPd_UP;
    if (onoff) {
        gpio_initstruct.GPIO_Mode  = GPIO_Mode_AF_PP;
        GPIO_Init((GPIO_TypeDef *)pinfo->gpio_base, &gpio_initstruct);
        //GPIO_PinAFConfig((GPIO_TypeDef *)pinfo->gpio_base, pinfo->pin_tx, GPIO_AF_4);
    } else {
        gpio_initstruct.GPIO_Mode  = GPIO_Mode_Out_PP;
        GPIO_Init((GPIO_TypeDef *)pinfo->gpio_base, &gpio_initstruct);
        GPIO_ResetBits((GPIO_TypeDef *)pinfo->gpio_base, (INT16U)(1 << pinfo->pin_tx));
    }
    
    /* Configure USARTx_Rx as input floating */
    gpio_initstruct.GPIO_Pin   = (INT16U)(1 << pinfo->pin_rx);
    gpio_initstruct.GPIO_Speed = GPIO_Speed_50MHz;
    //gpio_initstruct.GPIO_OType = GPIO_OType_PP;
    //gpio_initstruct.GPIO_PuPd  = GPIO_PuPd_UP;
    if (onoff) {
        gpio_initstruct.GPIO_Mode  = GPIO_Mode_IPU;
        GPIO_Init((GPIO_TypeDef *)pinfo->gpio_base, &gpio_initstruct);
        //GPIO_PinAFConfig((GPIO_TypeDef *)pinfo->gpio_base, pinfo->pin_rx, GPIO_AF_4);
    } else {
        gpio_initstruct.GPIO_Mode  = GPIO_Mode_Out_PP;
        GPIO_Init((GPIO_TypeDef *)pinfo->gpio_base, &gpio_initstruct);
        GPIO_ResetBits((GPIO_TypeDef *)pinfo->gpio_base, (INT16U)(1 << pinfo->pin_rx));
    }

    switch(pinfo->can_base) {
        case CAN1_BASE:
            GPIO_PinRemapConfig(GPIO_Remap1_CAN1 , ENABLE);
            break;
        case CAN2_BASE:
            //GPIO_PinRemapConfig(GPIO_Remap_CAN2, ENABLE);
            break;
    }

}

/*******************************************************************
** 函数名称: STM32_CAN_IrqConfig
** 函数描述: 配置中断功能
** 参数:     [in] pinfo: 配置参数
**           [in] inter: 中断配置
** 返回:     无
********************************************************************/
static void STM32_CAN_IrqConfig(const CAN_REG_T *pinfo)
{
    INT32S irq_id;
    INT32U flag;
    IRQ_SERVICE_FUNC irqhandler;
    
    if (pinfo == 0) {
        return;
    }
    
    switch (pinfo->can_base)
    {
    case CAN1_BASE:
        irq_id = CAN1_RX0_IRQn;
        irqhandler = (IRQ_SERVICE_FUNC)CAN1_Rx_IrqHandle;
        ST_IRQ_ConfigIrqEnable(irq_id, false);                                      /* 关闭中断 */
        ST_IRQ_InstallIrqHandler(irq_id, irqhandler);                               /* install irq handle */
        ST_IRQ_ConfigIrqPriority(irq_id, IRQ_PRIOTITY_CAN);
        ST_IRQ_ConfigIrqEnable(irq_id, true);                                       /* 打开中断 */

        irq_id = CAN1_RX1_IRQn;
        irqhandler = (IRQ_SERVICE_FUNC)CAN1_Rx1_IrqHandle;
        ST_IRQ_ConfigIrqEnable(irq_id, false);                                      /* 关闭中断 */
        ST_IRQ_InstallIrqHandler(irq_id, irqhandler);                               /* install irq handle */
        ST_IRQ_ConfigIrqPriority(irq_id, IRQ_PRIOTITY_CAN);
        ST_IRQ_ConfigIrqEnable(irq_id, true); 

        irq_id = CAN1_TX_IRQn;
        irqhandler = (IRQ_SERVICE_FUNC)CAN1_Tx_IrqHandle;
        ST_IRQ_ConfigIrqEnable(irq_id, false);                                      /* 关闭中断 */
        ST_IRQ_InstallIrqHandler(irq_id, irqhandler);                               /* install irq handle */
        ST_IRQ_ConfigIrqPriority(irq_id, IRQ_PRIOTITY_CAN);
        ST_IRQ_ConfigIrqEnable(irq_id, true);  
    	break;

    case CAN2_BASE: 
        irq_id = CAN2_RX0_IRQn;
        irqhandler = (IRQ_SERVICE_FUNC)CAN2_Rx_IrqHandle;
        ST_IRQ_ConfigIrqEnable(irq_id, false);                                      /* 关闭中断 */
        ST_IRQ_InstallIrqHandler(irq_id, irqhandler);                               /* install irq handle */
        ST_IRQ_ConfigIrqPriority(irq_id, IRQ_PRIOTITY_CAN);
        ST_IRQ_ConfigIrqEnable(irq_id, true);                                       /* 打开中断 */

        irq_id = CAN2_RX1_IRQn;
        irqhandler = (IRQ_SERVICE_FUNC)CAN2_Rx1_IrqHandle;
        ST_IRQ_ConfigIrqEnable(irq_id, false);                                      /* 关闭中断 */
        ST_IRQ_InstallIrqHandler(irq_id, irqhandler);                               /* install irq handle */
        ST_IRQ_ConfigIrqPriority(irq_id, IRQ_PRIOTITY_CAN);
        ST_IRQ_ConfigIrqEnable(irq_id, true);                                       /* 打开中断 */

        irq_id = CAN2_TX_IRQn;
        irqhandler = (IRQ_SERVICE_FUNC)CAN2_Tx_IrqHandle;
        ST_IRQ_ConfigIrqEnable(irq_id, false);                                      /* 关闭中断 */
        ST_IRQ_InstallIrqHandler(irq_id, irqhandler);                               /* install irq handle */
        ST_IRQ_ConfigIrqPriority(irq_id, IRQ_PRIOTITY_CAN);
        ST_IRQ_ConfigIrqEnable(irq_id, true);  
    	break;
    default:
        return;
    }
    
   
    
    flag = CAN_IT_FF0 | CAN_IT_FF1 | CAN_IT_FMP0 | CAN_IT_FMP1;// | CAN_IT_BOF | CAN_IT_ERR;
    //flag = CAN_IT_FMP0;
    CAN_ITConfig((CAN_TypeDef *)pinfo->can_base, flag, ENABLE);                 /* Enable Interrupt */
}


/*******************************************************************
** 函数名称: STM32_CAN_Init
** 函数描述: 串口通信参数配置，并设置是否支持DMA
** 参数:     [in]  cfg:串口配置参数 
** 返回:     无
********************************************************************/
static BOOLEAN STM32_CAN_Init(CAN_CFG_T *cfg)
{
    INT8U com, result = false;
    INT32U baud;
    CAN_InitTypeDef can_initstruct;
    const CAN_REG_T *pinfo;
	  
    com = cfg->com;
    pinfo = HAL_CAN_GetRegTblInfo(com);

    /* can clock enable */
    RCC_APB1PeriphClockCmd(pinfo->can_rcc, ENABLE);
    
    /* deinit can */
	//CAN_DeInit((CAN_TypeDef *)pinfo->can_base);

	
	/* CAN cell init */
	CAN_StructInit(&can_initstruct);
    can_initstruct.CAN_TTCM = DISABLE;                                         /* time triggered communication mode */
    can_initstruct.CAN_ABOM = ENABLE;                                          /* automatic bus-off management */
    can_initstruct.CAN_AWUM = ENABLE;                                          /* automatic wake-up mode */
    can_initstruct.CAN_NART = ENABLE;                                          /* non-automatic retransmission mode */
    can_initstruct.CAN_RFLM = DISABLE;                                         /* Receive FIFO Locked mode */
    can_initstruct.CAN_TXFP = DISABLE;                                         /* transmit FIFO priority */
    switch (cfg->mode)                                                         /* the CAN operating mode */
    {
    case CAN_WORK_MODE_NORMAL:
        can_initstruct.CAN_Mode = CAN_Mode_Normal;
        break;
    case CAN_WORK_MODE_LOOPBACK:
        can_initstruct.CAN_Mode = CAN_Mode_LoopBack;
        break;
    case CAN_WORK_MODE_SILENT:
        can_initstruct.CAN_Mode = CAN_Mode_Silent;
        break;
    case CAN_WORK_MODE_SILENT_LOOPBACK:
        can_initstruct.CAN_Mode = CAN_Mode_Silent_LoopBack;
        break;
    default:
        can_initstruct.CAN_Mode = CAN_Mode_Normal;
        break;
    }
    
