starjunes/GD32/source/hal/driver/c/hal_can_drv.c
    /* CAN Baudrate = 1MBps (CAN clocked at 48 MHz) */
    baud = cfg->baud;
   // can_initstruct.CAN_SJW = CAN_SJW_1tq;                                      /* bit to perform resynchronization */
   // can_initstruct.CAN_BS1 = CAN_BS1_15tq;                                     /* Segment 1 */
   // can_initstruct.CAN_BS2 = CAN_BS2_8tq;                                      /* Segment 2 */
   // can_initstruct.CAN_Prescaler = 2 * (1000000 / baud);                       /* Specifies the length of a time quantum. It ranges from 1 to 1024. */

    can_initstruct.CAN_SJW = CAN_SJW_1tq;                                      /* bit to perform resynchronization */
    can_initstruct.CAN_BS1 = CAN_BS1_3tq;                                     /* Segment 1 */
    can_initstruct.CAN_BS2 = CAN_BS2_2tq;                                     /* Segment 2 */
    can_initstruct.CAN_Prescaler = (36000000 / (baud * (1 + 3 + 2)));       /* Specifies the length of a time quantum. It ranges from 1 to 1024. */
	
	/* configure can */
    result = CAN_Init((CAN_TypeDef *)pinfo->can_base, &can_initstruct);
    if (result == CAN_InitStatus_Success) {
        result = TRUE;
        STM32_CAN_IrqConfig(pinfo);                                            /* 配置中断使能 */
    } else {
        result = FALSE;
    }
    return result;
}

/*******************************************************************
** 函数名称: HAL_CAN_InitDrv
** 函数描述: 初始化驱动
** 参数:     无
** 返回:     无
********************************************************************/
void HAL_CAN_InitDrv(void)
{
    YX_MEMSET(&s_can, 0, sizeof(s_can));
}

/*******************************************************************
** 函数名:     HAL_CAN_GetStatus
** 函数描述:   获取CAN总线状态
** 参数:       [in] com:  通道编号,见 CAN_COM_E
**             [in] info: 状态信息,见 CAN_STATUS_T
** 返回:       成功返回true, 失败返回false
********************************************************************/
BOOLEAN HAL_CAN_GetStatus(INT8U com, CAN_STATUS_T *info)
{
    const CAN_REG_T *pinfo;
    
    if (com >= CAN_COM_MAX) {
        return false;
    }
    
    pinfo = HAL_CAN_GetRegTblInfo(com);
    
    info->status = HAL_CAN_IsOpened(com);
    info->lec    = CAN_GetLastErrorCode((CAN_TypeDef *)pinfo->can_base) >> 4;
    info->rec    = CAN_GetReceiveErrorCounter((CAN_TypeDef *)pinfo->can_base);
    info->tec    = CAN_GetLSBTransmitErrorCounter((CAN_TypeDef *)pinfo->can_base);
    
    if (CAN_GetFlagStatus((CAN_TypeDef *)pinfo->can_base, CAN_FLAG_BOF) == SET) {/* 总线关闭 */
        info->errorstep = CAN_ERROR_STEP_BUSOFF;
    } else if (CAN_GetFlagStatus((CAN_TypeDef *)pinfo->can_base, CAN_FLAG_EPV) == SET) {/* 被动错误 */
        info->errorstep = CAN_ERROR_STEP_PASSIVE;
    } else if (CAN_GetFlagStatus((CAN_TypeDef *)pinfo->can_base, CAN_FLAG_EWG) == SET) {/* 错误警告 */
        info->errorstep = CAN_ERROR_STEP_WARNING;
    } else if (info->rec > 0 && info->tec > 0) {                               /* 主动错误 */
        info->errorstep = CAN_ERROR_STEP_ACTIVE;
    } else {
        info->errorstep = CAN_ERROR_STEP_NOERR;
    }
    
    return true;
}

/*******************************************************************
** 函数名称:   HAL_CAN_IsOpened
** 函数描述:   通道是否已打开
** 参数:       [in] com: 通道编号,见CAN_COM_E
** 返回:       是返回true,否返回false
********************************************************************/
BOOLEAN HAL_CAN_IsOpened(INT8U com)
{
    if (com >= CAN_COM_MAX) {
        return false;
    }
    
    if ((s_can[com].status &_OPEN) != 0) {
        return true;
    } else {
        return false;
    }
}

/*******************************************************************
** 函数名称:   HAL_CAN_OpenCan
** 函数描述:   打开CAN通信总线
** 参数:       [in]  cfg: 配置参数 
** 返回:       成功返回true,失败返回false
********************************************************************/
BOOLEAN HAL_CAN_OpenCan(CAN_CFG_T *cfg)
{
    INT8U com;
    const CAN_REG_T *pinfo;
    
    OS_ASSERT((cfg != 0), RETURN_FALSE);
    //OS_ASSERT((cfg->com < CAN_COM_MAX), RETURN_FALSE);
    if (cfg->com >= CAN_COM_MAX) {
        return false;
    }
    
    com = cfg->com;
    pinfo = HAL_CAN_GetRegTblInfo(com);
    if (pinfo->enable == 0) {
        return false;
    }
    
    if ((s_can[com].status & _OPEN) != 0) {                                    /* 已打开 */
        s_can[com].status &= ~(_OPEN | _SENDING);
        
	    CAN_DeInit((CAN_TypeDef *)pinfo->can_base);                            /* deinit can */
    }
    
    s_can[com].recvloop.pmsg = &s_can_recv[com][0];                            /* 接收缓存 */
    s_can[com].recvloop.used = 0;
    s_can[com].recvloop.pos  = 0;
    s_can[com].recvloop.max  = MAX_CAN_RECV;
    
    s_can[com].sendloop.pmsg = &s_can_send[com][0];                            /* 发送缓存 */
    s_can[com].sendloop.used = 0;
    s_can[com].sendloop.pos  = 0;
    s_can[com].sendloop.max  = MAX_CAN_SEND;
    
    STM32_CAN_PinsConfig(pinfo, TRUE);                                         /* configure the rx & tx pins */
    if (STM32_CAN_Init(cfg)) {                                                 /* 通信参数配置 */
        s_can[com].status = _OPEN;
        return true;
    } else {
        return false;
    }
}

/*******************************************************************
** 函数名:     HAL_CAN_CloseCan
** 函数描述:   关闭CAN总线
** 参数:       [in] com: 通道编号,见CAN_COM_E
** 返回:       成功返回true, 失败返回false
********************************************************************/
BOOLEAN HAL_CAN_CloseCan(INT8U com)
{
    const CAN_REG_T *pinfo;
    
    if (com >= CAN_COM_MAX) {
        return false;
    }
    
    pinfo = HAL_CAN_GetRegTblInfo(com);
    if (pinfo->enable == 0) {
        return false;
    }
    STM32_CAN_PinsConfig(pinfo, FALSE);
    if ((s_can[com].status & _OPEN) != 0) {                                    /* 串口已打开 */
        CAN_DeInit((CAN_TypeDef *)pinfo->can_base);                            /* deinit can */
    }
    s_can[com].status &= ~(_OPEN | _SENDING);
    
    return true;
}

/*******************************************************************
** 函数名:     HAL_CAN_SetFilterParaByList
** 函数描述:   设置滤波参数,设置滤波ID列表过滤方式
** 参数:       [in] com:       通道编号,见 CAN_COM_E
**             [in] idtype:    帧ID类型,见 CAN_ID_TYPE_E
**             [in] idnum:     滤波ID个数,为0时表示接收所有ID
**             [in] pfilterid: 滤波ID数组
** 返回:       成功返回true, 失败返回false
********************************************************************/
BOOLEAN HAL_CAN_SetFilterParaByList(INT8U com, INT8U idtype, INT8U idnum, INT32U *pfilterid)
{
    INT8U i;
    INT8U ch_offset; 
    INT32U filterid;
    CAN_FilterInitTypeDef  can_filterinitstructure;
    const CAN_REG_T *pinfo;
    
    if (com >= CAN_COM_MAX) {
        return false;
    }
    
    if ((s_can[com].status & _OPEN) == 0) {
        return false;
    }

    pinfo = HAL_CAN_GetRegTblInfo(com);
    ch_offset = (com * 14);
    if (idtype == CAN_ID_TYPE_STD) {                                           /* 标准帧 */
        can_filterinitstructure.CAN_FilterMode           = CAN_FilterMode_IdList;
        can_filterinitstructure.CAN_FilterScale          = CAN_FilterScale_16bit;
        can_filterinitstructure.CAN_FilterFIFOAssignment = pinfo->fifo;
        can_filterinitstructure.CAN_FilterActivation     = ENABLE;
        
        for (i = 0; i < idnum && i < MAX_CAN_FILTER_ID_LIST_STD; i++) {
            filterid = pfilterid[i] << 5;
            
