starjunes/GD32/source/hal/driver/c/hal_can_drv.c
            if ((i % 4) == 0) {
                can_filterinitstructure.CAN_FilterIdHigh     = filterid & 0xFFFF;
                can_filterinitstructure.CAN_FilterIdLow      = filterid & 0xFFFF;
                can_filterinitstructure.CAN_FilterMaskIdHigh = filterid & 0xFFFF;
                can_filterinitstructure.CAN_FilterMaskIdLow  = filterid & 0xFFFF;
                can_filterinitstructure.CAN_FilterNumber     = i / 4 + ch_offset;
            } else if ((i % 4) == 1) {
                can_filterinitstructure.CAN_FilterIdLow      = filterid & 0xFFFF;
            } else if ((i % 4) == 2) {
                can_filterinitstructure.CAN_FilterMaskIdHigh = filterid & 0xFFFF;
            } else if ((i % 4) == 3) {
                can_filterinitstructure.CAN_FilterMaskIdLow  = filterid & 0xFFFF;
                can_filterinitstructure.CAN_FilterNumber     = i / 4 + ch_offset;
                CAN_FilterInit(&can_filterinitstructure);
            }
        }
        
        if ((i % 4) != 0) {
            CAN_FilterInit(&can_filterinitstructure);
        }
        
        for (i = (i + 3) / 4; i < MAX_CAN_FILTER_ID_BANK; i++) {               /* 关闭剩余滤波器组 */
            can_filterinitstructure.CAN_FilterActivation = DISABLE;
            can_filterinitstructure.CAN_FilterNumber     = i + ch_offset;
            CAN_FilterInit(&can_filterinitstructure);
        }
    } else {
        can_filterinitstructure.CAN_FilterMode           = CAN_FilterMode_IdList;
        can_filterinitstructure.CAN_FilterScale          = CAN_FilterScale_32bit;
        can_filterinitstructure.CAN_FilterFIFOAssignment = pinfo->fifo;
        can_filterinitstructure.CAN_FilterActivation     = ENABLE;
            
        for (i = 0; i < idnum && i < MAX_CAN_FILTER_ID_LIST_EXT; i++) {
            filterid = (pfilterid[i] << 3) | 0x04;                             /* 0x04表示扩展帧 */
            
            if ((i % 2) == 0) {
                can_filterinitstructure.CAN_FilterIdHigh     = (filterid >> 16) & 0xFFFF;
                can_filterinitstructure.CAN_FilterIdLow      = filterid & 0xFFFF;
                can_filterinitstructure.CAN_FilterMaskIdHigh = (filterid >> 16) & 0xFFFF;
                can_filterinitstructure.CAN_FilterMaskIdLow  = filterid & 0xFFFF;
                can_filterinitstructure.CAN_FilterNumber     = i / 2 + ch_offset;
            } else {
                can_filterinitstructure.CAN_FilterMaskIdHigh = (filterid >> 16) & 0xFFFF;
                can_filterinitstructure.CAN_FilterMaskIdLow  = filterid & 0xFFFF;
                can_filterinitstructure.CAN_FilterNumber     = i / 2 + ch_offset;
                CAN_FilterInit(&can_filterinitstructure);
            }
        }
        
        if ((i % 2) != 0) {
            CAN_FilterInit(&can_filterinitstructure);
        }
        
        for (i = (i + 1) / 2; i < MAX_CAN_FILTER_ID_BANK; i++) {               /* 关闭剩余滤波器组 */
            can_filterinitstructure.CAN_FilterActivation = DISABLE;
            can_filterinitstructure.CAN_FilterNumber     = i + ch_offset;
            CAN_FilterInit(&can_filterinitstructure);
        }
    }
    
    if (idnum == 0) {                                                          /* 滤波ID个数为0,表示不滤波,接收所有数据帧 */
        can_filterinitstructure.CAN_FilterMode       = CAN_FilterMode_IdMask;
        can_filterinitstructure.CAN_FilterActivation = ENABLE;
        can_filterinitstructure.CAN_FilterIdHigh     = 0;
        can_filterinitstructure.CAN_FilterIdLow      = 0;
        can_filterinitstructure.CAN_FilterMaskIdHigh = 0;
        can_filterinitstructure.CAN_FilterMaskIdLow  = 0;
        can_filterinitstructure.CAN_FilterNumber     = 0 + ch_offset;
        CAN_FilterInit(&can_filterinitstructure);
    }
    return true;
}

/*******************************************************************
** 函数名:     HAL_CAN_SetFilterParaByMask
** 函数描述:   设置滤波参数,设置滤波ID掩码过滤方式
** 参数:       [in] com:      通道编号,见 CAN_COM_E
**             [in] idtype:   帧ID类型,见 CAN_ID_TYPE_E
**             [in] idnum:    滤波ID个数,为0时表示接收所有ID
**             [in] pfilterid: 滤波ID数组
**             [in] pmaskid:   掩码ID数组
** 返回:       成功返回true, 失败返回false
********************************************************************/
BOOLEAN HAL_CAN_SetFilterParaByMask(INT8U com, INT8U idtype, INT8U idnum, INT32U *pfilterid, INT32U *pmaskid)
{
    INT8U i;
    INT8U ch_offset;                                                           /* 通道偏移 */
    INT32U filterid, maskid;
    CAN_FilterInitTypeDef  can_filterinitstructure;
    const CAN_REG_T *pinfo;
    
    if (com >= CAN_COM_MAX) {
        return false;
    }
    
    if ((s_can[com].status & _OPEN) == 0) {
        return false;
    }

    pinfo = HAL_CAN_GetRegTblInfo(com);
    ch_offset = (com*14);
    if (idtype == CAN_ID_TYPE_STD) {
        can_filterinitstructure.CAN_FilterMode           = CAN_FilterMode_IdMask;
        can_filterinitstructure.CAN_FilterScale          = CAN_FilterScale_16bit;
        can_filterinitstructure.CAN_FilterFIFOAssignment = pinfo->fifo;
        can_filterinitstructure.CAN_FilterActivation     = ENABLE;
        
        for (i = 0; i < idnum && i < MAX_CAN_FILTER_ID_MASK_STD; i++) {
            filterid = pfilterid[i] << 5;
            maskid   = (pmaskid[i] << 5) | 0x08;                               /* 0x08需要掩码标准帧位 */
            
            if ((i % 2) == 0) {
                can_filterinitstructure.CAN_FilterIdHigh     = filterid & 0xFFFF;
                can_filterinitstructure.CAN_FilterMaskIdHigh = maskid & 0xFFFF;
                can_filterinitstructure.CAN_FilterIdLow      = filterid & 0xFFFF;
                can_filterinitstructure.CAN_FilterMaskIdLow  = maskid & 0xFFFF;
                can_filterinitstructure.CAN_FilterNumber     = i / 2 + ch_offset;
            } else {
                can_filterinitstructure.CAN_FilterIdLow      = filterid & 0xFFFF;
                can_filterinitstructure.CAN_FilterMaskIdLow  = maskid & 0xFFFF;
                can_filterinitstructure.CAN_FilterNumber     = i / 2 + ch_offset;
                CAN_FilterInit(&can_filterinitstructure);
            }
        }
        
        if ((i % 2) != 0) {
            CAN_FilterInit(&can_filterinitstructure);
        }
        
        for (i = (i + 1) / 2; i < MAX_CAN_FILTER_ID_BANK; i++) {               /* 关闭剩余滤波器组 */
            can_filterinitstructure.CAN_FilterActivation = DISABLE;
            can_filterinitstructure.CAN_FilterNumber     = i + ch_offset;
            CAN_FilterInit(&can_filterinitstructure);
        }
    } else {
        can_filterinitstructure.CAN_FilterMode           = CAN_FilterMode_IdMask;
        can_filterinitstructure.CAN_FilterScale          = CAN_FilterScale_32bit;
        can_filterinitstructure.CAN_FilterFIFOAssignment = pinfo->fifo;
        can_filterinitstructure.CAN_FilterActivation     = ENABLE;
            
        for (i = 0; i < idnum && i < MAX_CAN_FILTER_ID_MASK_EXT; i++) {
            filterid = (pfilterid[i] << 3) | 0x04;                             /* 0x04表示扩展帧 */
            maskid   = (pmaskid[i] << 3) | 0x04;
            
