starjunes/GD32/source/hal/driver/c/hal_can_drv.c
            can_filterinitstructure.CAN_FilterIdHigh     = (filterid >> 16) & 0xFFFF;
            can_filterinitstructure.CAN_FilterIdLow      = filterid & 0xFFFF;
            can_filterinitstructure.CAN_FilterMaskIdHigh = (maskid >> 16) & 0xFFFF;
            can_filterinitstructure.CAN_FilterMaskIdLow  = maskid & 0xFFFF;
            can_filterinitstructure.CAN_FilterNumber     = i + ch_offset;
            CAN_FilterInit(&can_filterinitstructure);
        }
        
        for (; i < MAX_CAN_FILTER_ID_BANK; i++) {                              /* 关闭剩余滤波器组 */
            can_filterinitstructure.CAN_FilterActivation = DISABLE;
            can_filterinitstructure.CAN_FilterNumber     = i + ch_offset;
            CAN_FilterInit(&can_filterinitstructure);
        }
    }
    
    if (idnum == 0) {                                                          /* 滤波ID个数为0,表示不滤波,接收所有数据帧 */
        can_filterinitstructure.CAN_FilterMode       = CAN_FilterMode_IdMask;
        can_filterinitstructure.CAN_FilterActivation = ENABLE;
        can_filterinitstructure.CAN_FilterIdHigh     = 0;
        can_filterinitstructure.CAN_FilterIdLow      = 0;
        can_filterinitstructure.CAN_FilterMaskIdHigh = 0;
        can_filterinitstructure.CAN_FilterMaskIdLow  = 0;
        can_filterinitstructure.CAN_FilterNumber     = 0 + ch_offset;
        CAN_FilterInit(&can_filterinitstructure);
    }
    return true;
}

/*******************************************************************
** 函数名称: HAL_CAN_ReadData
** 函数描述: 读取一帧数据
** 参数:     [in]  com:  通道编号,见CAN_COM_E
**           [out] data: 数据帧
** 返回:     成功返回数据，失败返回-1
********************************************************************/
BOOLEAN HAL_CAN_ReadData(INT8U com, CAN_DATA_T *data)
{
    if (com >= CAN_COM_MAX) {
        return false;
    }
    
    if ((s_can[com].status & _OPEN) == 0) {
        return false;
    }
    
    return ReadLoopData(&s_can[com].recvloop, data);
}

/*******************************************************************
** 函数名称: HAL_CAN_SendData
** 函数描述: 发送一帧数据
** 参数:     [in] com:  通道编号,见CAN_COM_E
**           [in] data: 数据帧
** 返回:     成功返回true,失败返回false
********************************************************************/
static BOOLEAN StartCanSend(const CAN_REG_T *pinfo, CAN_DATA_T *data);
BOOLEAN HAL_CAN_SendData(INT8U com, CAN_DATA_T *data)
{
    INT8U result;
    volatile INT32U cpu_sr;
    const CAN_REG_T *pinfo;
    CAN_DATA_T candata;

    if (com >= CAN_COM_MAX) {
        return FALSE;
    }
    
    if ((s_can[com].status & _OPEN) == 0) {
        return FALSE;
    }
    
    result = WriteLoopData(&s_can[com].sendloop, data);
    pinfo = HAL_CAN_GetRegTblInfo(com);
    
    OS_ENTER_CRITICAL();
    if ((s_can[com].status & _SENDING) == 0) {
        OS_EXIT_CRITICAL();
        
        CAN_ITConfig((CAN_TypeDef *)pinfo->can_base, CAN_IT_TME, DISABLE);     /* 关闭发送中断 */
        
        CAN_CancelTransmit((CAN_TypeDef *)pinfo->can_base, 0);
        CAN_CancelTransmit((CAN_TypeDef *)pinfo->can_base, 1);
        CAN_CancelTransmit((CAN_TypeDef *)pinfo->can_base, 2);
        
        ReadLoopData_INT(&s_can[com].sendloop, &candata);
        if (StartCanSend(pinfo, &candata)) {
            s_can[com].status |= _SENDING;
            CAN_ITConfig((CAN_TypeDef *)pinfo->can_base, CAN_IT_TME, ENABLE);  /* 打开发送中断 */
        }
    } else {
        OS_EXIT_CRITICAL();
    }
    
    return result;
}

/*******************************************************************
** 函数名称: HAL_CAN_UsedOfRecvbuf
** 函数描述: 获取已接收帧数
** 参数:     [in] com: 通道编号,见CAN_COM_E
** 返回:     已接收数据帧数
********************************************************************/
INT32U HAL_CAN_UsedOfRecvbuf(INT8U com)
{
    if (com >= CAN_COM_MAX) {
        return 0;
    }
    
    if ((s_can[com].status & _OPEN) == 0) {
        return 0;
    }
    
    return UsedOfLoopBuffer(&s_can[com].recvloop);
}

/*******************************************************************
** 函数名称: HAL_CAN_LeftOfSendbuf
** 函数描述: 获取发送缓存剩余空间
** 参数:     [in] com: 通道编号,见CAN_COM_E
** 返回:     剩余数据帧数
********************************************************************/
INT32U HAL_CAN_LeftOfSendbuf(INT8U com)
{
    if (com >= CAN_COM_MAX) {
        return 0;
    }
    
    if ((s_can[com].status & _OPEN) == 0) {
        return 0;
    }
    
    return LeftOfLoopBuffer(&s_can[com].sendloop);
}

/*******************************************************************
** 函数名称: CAN1_IrqHandle
** 函数描述: CAN中断处理
** 参数:     无
** 返回:     无
********************************************************************/
static BOOLEAN StartCanSend(const CAN_REG_T *pinfo, CAN_DATA_T *data)
{
    INT8U mailbox;
    CanTxMsg txmessage;
    
    if (data->idtype == CAN_ID_TYPE_STD) {                                 /* 标准ID */
        txmessage.IDE   = CAN_ID_STD;
        txmessage.StdId = data->id;
        txmessage.ExtId = 0x00;
    } else {
        txmessage.IDE   = CAN_ID_EXT;
        txmessage.StdId = 0x00;
        txmessage.ExtId = data->id;
    }
    
    if (data->datatype == CAN_RTR_TYPE_DATA) {                             /* 数据帧 */
        txmessage.RTR = CAN_RTR_DATA;
    } else {
        txmessage.RTR = CAN_RTR_REMOTE;
    }
    
    txmessage.DLC = data->dlc;
    YX_MEMCPY(txmessage.Data, 8, data->data, 8);
        
    mailbox = CAN_Transmit((CAN_TypeDef *)pinfo->can_base, &txmessage);
    if (mailbox == CAN_TxStatus_NoMailBox) {
        CAN_CancelTransmit((CAN_TypeDef *)pinfo->can_base, 0);
        CAN_CancelTransmit((CAN_TypeDef *)pinfo->can_base, 1);
        CAN_CancelTransmit((CAN_TypeDef *)pinfo->can_base, 2);
        return false;
    } else {
        return true;
    }
}


__attribute__ ((section ("IRQ_HANDLE"))) void CAN_Recive_IRQ(CAN_TypeDef* CANx, INT8U FIFONumber, INT32U flag)
{
    INT8U i, j, com;
    CanRxMsg rxmessage;
    CAN_DATA_T recvdata;
    
    com = CAN_COM_0;
    switch((INT32U)CANx) {
        case CAN1_BASE:
            com = CAN_COM_0;
            break;
        case CAN2_BASE:
            com = CAN_COM_1;
            break;

            default:
                return;
    }
    if (CAN_GetFlagStatus((CAN_TypeDef *)CANx, flag) != RESET) {                       /* FIFO0数据接收中断 */
        CAN_ClearITPendingBit(CANx, flag);                               /* Clears the CAN1 interrupt pending bit */
       
