starjunes/GD32/source/hal/driver/c/hal_can_drv.c
        for (i = 0; i < 1; i++) {
            CAN_Receive((CAN_TypeDef *)CANx, FIFONumber, &rxmessage);
            
            if (rxmessage.IDE == CAN_ID_STD) {
                recvdata.idtype = CAN_ID_TYPE_STD;
                recvdata.id     = rxmessage.StdId;
            } else {
                recvdata.idtype = CAN_ID_TYPE_EXT;
                recvdata.id     = rxmessage.ExtId;
            }
            
            if (rxmessage.RTR == CAN_RTR_DATA) {
                recvdata.datatype = CAN_RTR_TYPE_DATA;
            } else {
                recvdata.datatype = CAN_RTR_TYPE_REMOTE;
            }
            
            recvdata.index = rxmessage.FMI;
            recvdata.dlc   = rxmessage.DLC;
            
            for (j = 0; j < rxmessage.DLC; j++) {
                recvdata.data[j] = rxmessage.Data[j];
            }
            
            WriteLoopData_INT(&s_can[com].recvloop, &recvdata);
            
            #if DEBUG_CAN > 0
            printf_com("CAN%d_IrqHandle(ID:%08x)(idtype:%d)(datatype:%d)(FIFONumber:%d)\r\n",com, recvdata.id
                                                                                            ,recvdata.idtype
                                                                                            , recvdata.datatype
                                                                                            , FIFONumber);
            printf_hex(recvdata.data, recvdata.dlc);
            printf_com("\r\n");
            #endif
        }
    }
}



__attribute__ ((section ("IRQ_HANDLE"))) void CAN1_Rx_IrqHandle(void)
{

   CAN_Recive_IRQ(CAN1, CAN_FIFO0, CAN_FLAG_FMP0);
}

__attribute__ ((section ("IRQ_HANDLE"))) void CAN1_Rx1_IrqHandle(void)
{

    CAN_Recive_IRQ(CAN1, CAN_FIFO1, CAN_FLAG_FMP1);
    
}

__attribute__ ((section ("IRQ_HANDLE"))) void CAN1_Tx_IrqHandle(void)
{
    INT8U  used, com;
    CAN_DATA_T recvdata;
    const CAN_REG_T *pinfo;

    com = CAN_COM_0;
    if (CAN_GetITStatus(CAN1, CAN_IT_TME) != RESET) {                           /* 数据发送中断 */
        CAN_ClearITPendingBit(CAN1, CAN_IT_TME);                                /* Clears the CAN1 interrupt pending bit */
        
        pinfo = HAL_CAN_GetRegTblInfo(com);
        if (((s_can[com].status & _OPEN) == 0) || ((s_can[com].status & _SENDING) == 0)) {
            CAN_ITConfig((CAN_TypeDef *)pinfo->can_base, CAN_IT_TME, DISABLE); /* 关闭发送中断 */
        } else {
            used = UsedOfLoopBuffer_INT(&s_can[com].sendloop);
            if (used == 0) {                                                   /* 无数据要发送 */
                s_can[com].status &= (~_SENDING);
                CAN_ITConfig((CAN_TypeDef *)pinfo->can_base, CAN_IT_TME, DISABLE); /* 关闭发送中断 */
            } else {
                ReadLoopData_INT(&s_can[com].sendloop, &recvdata);
                StartCanSend(pinfo, &recvdata);
            }
        }
    }
}

__attribute__ ((section ("IRQ_HANDLE"))) void CAN2_Rx_IrqHandle(void)
{

    CAN_Recive_IRQ(CAN2, CAN_FIFO0, CAN_FLAG_FMP0);

}

__attribute__ ((section ("IRQ_HANDLE"))) void CAN2_Rx1_IrqHandle(void)
{

    CAN_Recive_IRQ(CAN2, CAN_FIFO1, CAN_FLAG_FMP1);

}


__attribute__ ((section ("IRQ_HANDLE"))) void CAN2_Tx_IrqHandle(void)
{
    INT8U  used, com;
    CAN_DATA_T recvdata;
    const CAN_REG_T *pinfo;

    com = CAN_COM_1;
    if (CAN_GetITStatus(CAN2, CAN_IT_TME) != RESET) {                           /* 数据发送中断 */
        CAN_ClearITPendingBit(CAN2, CAN_IT_TME);                                /* Clears the CAN1 interrupt pending bit */
        
        pinfo = HAL_CAN_GetRegTblInfo(com);
        if (((s_can[com].status & _OPEN) == 0) || ((s_can[com].status & _SENDING) == 0)) {
            CAN_ITConfig((CAN_TypeDef *)pinfo->can_base, CAN_IT_TME, DISABLE); /* 关闭发送中断 */
        } else {
            used = UsedOfLoopBuffer_INT(&s_can[com].sendloop);
            if (used == 0) {                                                   /* 无数据要发送 */
                s_can[com].status &= (~_SENDING);
                CAN_ITConfig((CAN_TypeDef *)pinfo->can_base, CAN_IT_TME, DISABLE); /* 关闭发送中断 */
            } else {
                ReadLoopData_INT(&s_can[com].sendloop, &recvdata);
                StartCanSend(pinfo, &recvdata);
            }
        }
    }
}


#endif


